micropython/micropython/ports/atmel-samd/boards/mini_sam_m0/mpconfigboard.h
// Board Name / MCU Type
#define MICROPY_HW_BOARD_NAME "Mini Sam M0"
#define MICROPY_HW_MCU_NAME "samd21e18"

// LED
#define MICROPY_HW_NEOPIXEL   (&pin_PA27)
//#define MICROPY_HW_LED_MSC  PIN_PA15 // red

// Do not reset these pins.
#define MICROPY_PORT_A        (PORT_PA24 | PORT_PA25)
#define MICROPY_PORT_B        (0)
#define MICROPY_PORT_C        (0)

#include "internal_flash.h"

#define CIRCUITPY_INTERNAL_NVM_SIZE 0

#define BOARD_FLASH_SIZE (0x00040000 - 0x2000 - 0x010000)

#define BOARD_HAS_CRYSTAL   1

#define DEFAULT_I2C_BUS_SCL (&pin_PA23)
#define DEFAULT_I2C_BUS_SDA (&pin_PA22)

#define DEFAULT_SPI_BUS_SCK (&pin_PA17)
#define DEFAULT_SPI_BUS_MOSI (&pin_PA16)
#define DEFAULT_SPI_BUS_MISO (&pin_PA19)

#define DEFAULT_UART_BUS_RX (&pin_PA11)
#define DEFAULT_UART_BUS_TX (&pin_PA10)

// USB is always used internally so skip the pin objects for it.
#define IGNORE_PIN_PA24     1
#define IGNORE_PIN_PA25     1
